# IsElevationWithinRange Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaBasedLoadBoundaryLineData..::..IsElevationWithinRange Method
AreaBasedLoadBoundaryLineData Class See Also
---
Checks whether the given elevation is between the bottom level and the top level(including the bottom level and the top level) of the area based load boundary line.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool IsElevationWithinRange(
	double elev
)
```

Visual Basic
---
```text
Public Function IsElevationWithinRange ( _
	elev As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool IsElevationWithinRange(
	double elev
)
```

# ### Parameters
elev
    Type: System..::..Double The elevation value.
# ### Return Value
True if given elevation is between the bottom level elevation and the top level elevation, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given value for elev is not a number -or- The given value for elev is not finite |

# See Also
AreaBasedLoadBoundaryLineData Class
Autodesk.Revit.DB.Electrical Namespace